Revit 2027 API
BuiltInFailures.ElectricalFailures.InvalidPathOfParallelConduits Property
 Invalid path of parallel conduits
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidPathOfParallelConduits { get; }
Public Shared ReadOnly Property InvalidPathOfParallelConduits As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidPathOfParallelConduits {
	FailureDefinitionId^ get ();
}
static member InvalidPathOfParallelConduits : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace